{
  "poses": [
    "Standing with arms crossed",
    "Walking confidently",
    "Sitting with one leg over knee",
    "Leaning against wall, serious look",
    "Hands in pockets, relaxed stance",
    "Looking over shoulder",
    "Standing with hands on hips",
    "Sitting on edge of chair, elbows on knees",
    "Leaning forward, elbows on table",
    "Standing with one hand in pocket",
    "Running hand through hair",
    "Standing tall, chest out",
    "Squatting, elbows on knees",
    "Leaning on prop, casual stance",
    "Standing with jacket over shoulder",
    "Standing with one hand in the pocket, the other holding a phone, with a 'I'm too cool for school' smirk.",
    "Leaning against a wall, with one ankle crossed over the other, showcasing stylish shoes.",
    "Looking into the camera with a 'come hither' gaze, while unbuttoning a shirt.",
    "Sitting on a motorbike, with a helmet under the arm, looking ready to conquer the world.",
    "Holding a glass of whiskey, with a 'I know what I'm doing' look in his eyes.",
    "Looking up from a book, with a 'who me?' expression, glasses slightly askew.",
    "Standing in the rain with a trench coat open, revealing a tailored suit beneath.",
    "Posing with a cigarette, but not actually smoking it, for a vintage vibe.",
    "Sitting on the edge of a bed, tie loosened, looking like he just stepped out of a high-stakes business meeting.",
    "Walking down the street, hands in pockets, with a 'don't mess with me' swagger.",
    "Adjusting a tie in the mirror, with a smug 'I know I look good' smile.",
    "Leaning against a bar, sipping a cocktail, with a 'I own this place' confidence.",
    "Standing in a doorway, with a 'you're welcome to join me' look over the shoulder.",
    "Walking away from an explosion, not looking back, with a 'it's just another Tuesday' attitude.",
    "Sitting in a luxurious chair, legs spread, with a 'I'm the king of this castle' posture.",
    "Holding a rose, looking like he just stepped out of a romance novel.",
    "Leaning over a railing, with a 'I dare you' expression.",
    "Looking out a penthouse window, with the city lights as his backdrop.",
    "Sitting on the hood of a sports car, with a 'you wish you were me' smirk.",
    "Standing in a library, with a book in hand, looking like the intellectual heartthrob.",
    "Posing with a guitar, playing a soft tune, looking like the lead singer of your dreams.",
    "Tying a bowtie, looking utterly charming and utterly irresistible.",
    "Standing in a spotlight, with a 'I was born for this' confidence.",
    "Walking away from a private jet, with the 'I'm going places' swagger.",
    "Holding a suitcase, looking like he's about to embark on an adventure."
  ]
}
