{
  "poses": [
    "Standing with one hand on hip",
    "Walking with flowing dress",
    "Sitting with legs crossed elegantly",
    "Over-the-shoulder look",
    "Hand on chin, thoughtful pose",
    "Twirl with skirt",
    "Leaning against wall, playful smile",
    "Sitting on knees, hands in lap",
    "Dramatic hair flip",
    "Holding hat with both hands",
    "Jumping with joy",
    "Elegant ballet pose",
    "Looking back while walking",
    "Resting chin on hand, elbow on knee",
    "Standing with arms raised gracefully",
    "A sultry look over the shoulder with a subtle hip pop.",
    "Running fingers through hair while biting the bottom lip.",
    "Leaning against the wall with one leg bent, showing a hint of thigh.",
    "Looking down with a playful smile, tracing a finger along the neckline.",
    "Bending down slightly, looking up with a mischievous gaze.",
    "Sitting on the edge of a chair, one leg crossed over the other, revealing a little toe-cleavage.",
    "Standing with hands on hips, pushing the chest out slightly and winking.",
    "Leaning over a table with elbows bent, showing a bit of side-boob.",
    "Turning away while untying the laces of a corset, looking back with a flirty smile.",
    "Lying on the bed, propped up on one elbow, with the sheets draped over the body in a seductive way.",
    "Strutting down an imaginary runway with a confident stride and a flick of the hair.",
    "Posing with a hand in the pocket of a stylish jacket, leaning back and smiling coyly.",
    "Twirling around in a cute skirt that flutters just right, revealing a peek of stocking tops.",
    "Looking at a mirror, brushing a strand of hair with a 'I'm so pretty' grin.",
    "Standing with one foot on a chair, pointing the toes and flaunting those high-heeled boots.",
    "Adjusting a stylish hat, with a sly smile that says 'I know you're looking.'",
    "Holding a silk scarf around the neck, letting it flutter in the breeze.",
    "Sitting cross-legged, leaning back with a hand behind the head, showcasing an elegant neckline.",
    "Looking into a mirror, smoothing out a dress with a smoldering gaze.",
    "Leaning on a railing, one hand on the hip, flaunting the curve of the waist.",
    "Spinning in a flowy dress, making it swirl around dramatically.",
    "Pulling down a pair of sunglasses with a 'who me?' look.",
    "Sipping tea with pinky out, lounging in a luxurious chair.",
    "Standing with a hand on the hip, the other playing with the hem of a short dress.",
    "Looking through a rack of clothes, with an 'I found the perfect one' grin.",
    "Holding a shopping bag with a sexy arch in the back.",
    "Standing with legs apart, leaning on a shopping cart, exuding power and style.",
    "Posing with a handbag slung over the shoulder, striking a pose like it's a fashion magazine cover.",
    "Tying a scarf in a sultry knot, looking up through long lashes.",
    "Leaning against a wall, one leg bent, showcasing the length of the legs.",
    "Sitting on the edge of a fountain, dangling a shoe and splashing a bit of water.",
    "Standing in the rain with an open umbrella, letting the water kiss the legs.",
    "Looking over the edge of a balcony, with the wind playing with the dress.",
    "Leaning on a motorcycle, looking like you own the city streets.",
    "Holding a bouquet of flowers, with a secret smile playing on the lips.",
    "Posing in front of a graffiti wall, one hand in a pocket, striking a rebellious pose.",
    "Sitting on the stairs, looking down with a 'daddy's little monster' vibe.",
    "Walking away, throwing a seductive glance over the shoulder.",
    "Holding an ice cream cone, with a playful lick that says 'you wish it was you.'",
    "Reading a book in a cozy nook, looking up with a 'distracted' smile.",
    "Standing in an elevator, pushing the buttons with the back of the hand.",
    "Leaning on a lamppost, looking up with a 'lost but found you' expression.",
    "Casually leaning against a car, with the keys dangling in the hand."
  ]
}
